# **Chapter 6**
# **Data Loading, Storage, and File Formats**

## **6.1 Reading and Writing Data in Text Format**

In [11]:
!cat ../examples/ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [12]:
import pandas as pd
df=pd.read_csv("../examples/ex1.csv")
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [13]:
pd.read_table("../examples/ex1.csv",sep=",")

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [14]:
!cat ../examples/ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [15]:
pd.read_csv("../examples/ex2.csv",header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [16]:
pd.read_csv('../examples/ex2.csv',names=['a','b','c','d','message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [17]:
names=['a','b','c','d','message']
pd.read_csv('../examples/ex2.csv',names=names,index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [18]:
!cat ../examples/csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [19]:
parsed=pd.read_csv("../examples/csv_mindex.csv",index_col=["key1","key2"])

In [20]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [21]:
list(open("../examples/ex3.txt"))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [22]:
result=pd.read_table("../examples/ex3.txt",sep="\s+")

In [23]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [24]:
!cat ../examples/ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [25]:
pd.read_csv("../examples/ex4.csv",skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [26]:
!cat ../examples/ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [27]:
result=pd.read_csv("../examples/ex5.csv")

In [28]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [29]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [30]:
result=pd.read_csv('../examples/ex5.csv',na_values=['NULL'])
#na_values= yazılan değeri eksik veri olarak sayıyor

In [31]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [32]:
sentinels={'message':['foo','NA'],'something':['two']}

In [33]:
result=pd.read_csv('../examples/ex5.csv',na_values=sentinels)

In [34]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

### **Reading Text Files in Pieces**

In [35]:
pd.options.display.max_rows=10

In [36]:
result=pd.read_csv('../examples/ex6.csv')

In [37]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [38]:
pd.read_csv("../examples/ex6.csv",nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [39]:
chunker=pd.read_csv("../examples/ex6.csv",chunksize=1000)

In [40]:
chunker

In [41]:
chunker=pd.read_csv('../examples/ex6.csv',chunksize=1000)
chunker

In [42]:
chunker=pd.read_csv("../examples/ex6.csv",chunksize=1000)

In [43]:
tot=pd.Series([],dtype="float64")

for piece in chunker:
    tot=tot.add(piece["key"].value_counts(),fill_value=0)
    
tot=tot.sort_values(ascending=False)
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

### **Writing Data to Text Format**

In [44]:
data=pd.read_csv('../examples/ex5.csv')

In [45]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [46]:
data.to_csv('../examples/out.csv')

In [47]:
!cat ../examples/out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [48]:
import sys
data.to_csv(sys.stdout,sep="|")

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [49]:
data.to_csv(sys.stdout,na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [50]:
data.to_csv(sys.stdout,index=False,header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [51]:
data.to_csv(sys.stdout,index=False,columns=['a','b','c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [52]:
dates=pd.date_range('1/1/2000', periods=7)

In [53]:
import numpy as np

In [54]:
ts=pd.Series(np.arange(7),index=dates)

In [55]:
ts.to_csv('../examples/tseries.csv')

In [56]:
!cat ../examples/tseries.csv

,0
2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

### **Working with Delimited Formats**

In [57]:
!cat ../examples/ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [58]:
import csv
f=open("../examples/ex7.csv")

In [59]:
reader=csv.reader(f)

In [60]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [61]:
with open('../examples/ex7.csv') as f:
    lines=list(csv.reader(f))

In [62]:
header,values=lines[0],lines[1:]

In [63]:
data_dict={h: v for h, v in zip(header,zip(*values))}

In [64]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [88]:
f=open("../examples/ex7.csv")
class my_dialect(csv.Dialect):
 lineterminator = '\n'
 delimiter = ';'
 quotechar = '"'
 quoting = csv.QUOTE_MINIMAL

In [89]:
reader = csv.reader(f, dialect=my_dialect)

In [90]:
reader = csv.reader(f, delimiter='|')

In [91]:
with open('mydata.csv', 'w') as f:
    writer = csv.writer(f, dialect=my_dialect)
    writer.writerow(('one', 'two', 'three'))
    writer.writerow(('1', '2', '3'))
    writer.writerow(('4', '5', '6'))
    writer.writerow(('7', '8', '9'))

### **JSON Data**

In [83]:
obj="""
{"name": "Wes",
  "places_lived": ["United States", "Spain", "Germany"],
  "pet":null,
  "siblings":[{"name":"Scott","age":30,"pets":["Zeus","Zuko"]},
                    {"name": "Katie", "age": 38,
                    "pets": ["Sixes", "Stache", "Cisco"]}]

}
"""

In [84]:
import json

In [85]:
result=json.loads(obj)

In [86]:
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [87]:
asjson=json.dumps(result)

In [95]:
siblings=pd.DataFrame(result['siblings'],columns=['name','age'])

In [96]:
siblings

    name  age
0  Scott   30
1  Katie   38

In [97]:
! cat ../examples/example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [98]:
data=pd.read_json('../examples/example.json')

In [99]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [100]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [101]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

### **XML and HTML: Web Scraping**

In [103]:
tables=pd.read_html("../examples/fdic_failed_bank_list.html")

In [104]:
len(tables)

1

In [105]:
failures=tables[0]

In [106]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [107]:
close_timestamps=pd.to_datetime(failures['Closing Date'])

In [108]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

#### **Parsing XML with lxml.objectify**

In [109]:
from lxml import objectify

In [116]:
path='../datasets/mta_perf/Performance_MNR.xml'

In [117]:
parsed = objectify.parse(open(path))
root = parsed.getroot()

In [118]:
data=[]

In [119]:
skip_fields=['PARENT_SEQ','INDICATOR_SEQ',
                         'DESIRED_CHANGE','DECIMAL_PLACES']

In [121]:
for elt in root .INDICATOR:
    el_data={}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag]=child.pyval
    data.append(el_data)

In [122]:
perf=pd.DataFrame(data)

In [123]:
perf.head()

,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,INDICATOR_UNIT,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,%,95,96.9,95,96.9
1,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,2,Service Indicators,M,%,95,96,95,95
2,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,3,Service Indicators,M,%,95,96.3,95,96.9
3,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,4,Service Indicators,M,%,95,96.8,95,98.3
4,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,5,Service Indicators,M,%,95,96.6,95,95.8

In [124]:
from io import StringIO

In [125]:
tag='<a href="http://www.google.com">Google</a>'

In [126]:
root = objectify.parse(StringIO(tag)).getroot()

In [127]:
root

In [128]:
root.get('href')

'http://www.google.com'

In [129]:
root.text

'Google'

## **6.2 Binary Data Formats**

In [2]:
import pandas as pd
frame=pd.read_csv('../examples/ex1.csv')

In [3]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [4]:
frame.to_pickle('../examples/frame_pickle')

In [5]:
pd.read_pickle('../examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

### **Using HDF5 Format**

In [7]:
import numpy as np
frame=pd.DataFrame({'a':np.random.randn(100)})

In [9]:
store=pd.HDFStore('mydata.h5')

In [10]:
store['obj1']=frame

In [11]:
store['obj1_col']=frame['a']

In [12]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [13]:
store['obj1']

           a
0   0.638537
1  -1.296979
2  -0.849107
3   1.060996
4  -1.042307
..       ...
95 -0.201927
96  0.059316
97  0.337956
98  1.800676
99 -1.243407

[100 rows x 1 columns]

In [14]:
store.put('obj2',frame,format='table')

In [15]:
store.select('obj2',where=['index>=10 and index<=15'])

           a
10 -0.738088
11 -1.560926
12 -0.963904
13  1.076322
14  0.765761
15 -0.686573

In [21]:
store.close()

In [22]:
frame.to_hdf('mydata.h5', 'obj3', format='table')

In [23]:
pd.read_hdf('mydata.h5', 'obj3', where=['index < 5'])

          a
0  0.638537
1 -1.296979
2 -0.849107
3  1.060996
4 -1.042307

### **Reading Microsoft Excel Files**

In [26]:
xlsx = pd.ExcelFile('../examples/ex1.xlsx')

In [27]:
pd.read_excel(xlsx,'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [28]:
frame=pd.read_excel('../examples/ex1.xlsx','Sheet1')

In [29]:
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [32]:
writer = pd.ExcelWriter('../examples/ex2.xlsx')

In [33]:
frame.to_excel(writer,'Sheet1')

In [34]:
writer.save()

In [35]:
frame.to_excel('../examples/ex2.xlsx')

## **6.3 Interacting with Web APIs**

In [36]:
import requests

In [46]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [47]:
resp=requests.get(url)

In [48]:
resp

In [49]:
data = resp.json()

In [50]:
data[0]['title']

'New dict call fixings #38138'

In [51]:
issues=pd.DataFrame(data,columns=['number','title','labels','state'])

In [52]:
issues

,number,title,labels,state
0,38298,New dict call fixings #38138,[],open
1,38297,DOC:,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
2,38296,BUG: DataFrame.transform(dict) drops columns n...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
3,38294,ENH: set the first code value in Categorical,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
4,38293,BUG: read_json does not respect chunksize,[],open
5,38292,BUG: read_csv raises IndexError when index_col...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
6,38291,REF: groupby op casting without try/except,"[{'id': 233160, 'node_id': 'MDU6TGFiZWwyMzMxNj...",open
7,38290,REF: move common arithmetic ops from Integer/F...,[],open
8,38289,CLN: remove internal usage of integer_array(),"[{'id': 211029535, 'node_id': 'MDU6TGFiZWwyMTE...",open
9,38287,DOC: Out-of-date list of sort algorithms,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
10,38286,BUG: GroupBy.first does not skip missing value...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
11,38285,REF: avoid catching all exceptions in libreduc...,[],open
12,38282,BUG: IntervalIndex.union with mismatched dtype...,[],open
13,38281,DOC: add to str.endswith / startswith that tup...,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
14,38278,BUG: DataError: No numeric types to aggregate ...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
15,38273,test groupby.indices for multiple groupby and ...,"[{'id': 233160, 'node_id': 'MDU6TGFiZWwyMzMxNj...",open
16,38271,BUG: setting object dtype Series row with an E...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
17,38270,BUG: Missing SettingwithCopyWarning with Multi...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
18,38269,BUG: _metadata does not persist through groupby,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
19,38267,BUG: Inconsistent behavior of `.replace()` in ...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
20,38266,BUG: Inserting array of same size with Series....,"[{'id': 2822098, 'node_id': 'MDU6TGFiZWwyODIyM...",open
21,38264,"REF: implement Groupby idxmin, idxmax without ...","[{'id': 233160, 'node_id': 'MDU6TGFiZWwyMzMxNj...",open
22,38262,BUG: to_hdf and HDFStore for subclasses,[],open
23,38258,TST: mark all excel tests as slow,[],open
24,38257,BUG: groupby.apply on the NaN group drops valu...,[],open
25,38256,"BUG: pandas to_json with orient ""table"" return...","[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
26,38254,BUG: incorrect EA casting in groubpy.agg,"[{'id': 31404521, 'node_id': 'MDU6TGFiZWwzMTQw...",open
27,38249,"Fix C408 Errors in core/strings, core/arrays, ...",[],open
28,38247,BUG: Limited available colors,"[{'id': 2413328, 'node_id': 'MDU6TGFiZWwyNDEzM...",open
29,38246,BUG: Allow numeric ExtensionDtypes in DataFram...,"[{'id': 31404521, 'node_id': 'MDU6TGFiZWwzMTQw...",open

## **6.4 Interacting with Databases**

In [53]:
import sqlite3

In [64]:
query="""
CREATE TABLE test
(a VARCHAR(20),b VARCHAR(20),
c REAL,                  d INTEGER
);"""

In [65]:
con=sqlite3.connect('mydata.sqlite')

In [66]:
con.execute(query)

In [67]:
con.commit()

In [68]:
data=[('Atlanta','Georgia',1.25,6),
     ('Tallahassee','Florida',2.6,3),
     ('Sacramento','California',1.7,5)]

In [69]:
stmt='INSERT INTO test VALUES(?,?,?,?)'

In [70]:
con.executemany(stmt,data)

In [71]:
con.commit()

In [72]:
cursor=con.execute('select * from test')

In [73]:
rows=cursor.fetchall()

In [74]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [75]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [76]:
pd.DataFrame(rows,columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [78]:
 import sqlalchemy as sqla

In [79]:
 db = sqla.create_engine('sqlite:///mydata.sqlite')

In [80]:
pd.read_sql('select * from test', db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

## **6.5 Conclusion**